package ru.gb.lesson4;

public class Homework {

    // 1. Реализовать поиск максимального элемента в дереве. Метод назвать findLast
    // 2. Реализовать подсчет листьев. Листья - это такие узлы дерева, у которых нет дочерних элементов. Метод назвать getChildrenCount
    // 3. *Реализовать проверку, является ли дерево сбалансированным. Метод назвать isBalanced() и он должен возвращать true\false
    // Дерево назвается сбалансированным, если высота левого и правого поддерева отличается не больше, чем на 1
    // Для каждого корня проверить сбалансированность левого и правого подеревьев
    // isBalanced() {
    //   return isBalanced(root.left) && isBalanced(root.right)
    //   && Math.abs(height(root.left) - height(root.right)) <= 1
    // }
    // private int height(Node current) {
    //      // вот это нужно реализовать
    // }

    //             8
    //      6             10
    //  3
    //1

}
